hugo/public/singleboard/usb-gadget/index.html
<!DOCTYPE html>
<html lang="ja-jp">
<head><meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<title>USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする - 公開技術情報</title>
<meta name="generator" content="Hugo 0.100.1" />
<link href="https://ifritjp.github.io/documentsindex.xml" rel="alternate" type="application/rss+xml">
<link rel="canonical" href="https://ifritjp.github.io/documents/singleboard/usb-gadget/">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/theme.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/chroma.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/custom.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/highlight_lns.css">
<meta property="og:title" content="USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする" />
<meta property="og:description" content="Raspberry Pi を HID Keyboard デバイスにする方法、 あるいは RNDIS デバイスにする方法はネット上に色々転がっていますが、 複合デバイスにする方法はあまりまとまっていなかっ" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://ifritjp.github.io/documents/singleboard/usb-gadget/" /><meta property="article:section" content="singleboard" />

<meta property="og:site_name" content="公開技術情報" />

<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする"/>
<meta name="twitter:description" content="Raspberry Pi を HID Keyboard デバイスにする方法、 あるいは RNDIS デバイスにする方法はネット上に色々転がっていますが、 複合デバイスにする方法はあまりまとまっていなかっ"/>
<meta itemprop="name" content="USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする">
<meta itemprop="description" content="Raspberry Pi を HID Keyboard デバイスにする方法、 あるいは RNDIS デバイスにする方法はネット上に色々転がっていますが、 複合デバイスにする方法はあまりまとまっていなかっ">

<meta itemprop="wordCount" content="1648">
<meta itemprop="keywords" content="" />
</head>
<body><div class="container"><header>
<h1>公開技術情報</h1>


[<a href="https://ifritjp.github.io/documents/en/">English</a>]

[<a href="https://ifritjp.github.io/documents/">Japanese</a>]

</header>
<div class="global-menu">
<nav>
<ul>
<li><a href="/documents/">Home</a></li>
<li><a href="https://ifritjp.github.io/blog2/public/">blog</a></li>
<li><a href="https://ifritjp.github.io/LuneScript-webFront/lnsc_web_frontend/for_fengari/">LuneScript on Web</a></li></ul>
</nav>
</div>
<div class="content-container">
<main><h1>USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする</h1>

<p>
Raspberry Pi を HID Keyboard デバイスにする方法、
あるいは RNDIS デバイスにする方法はネット上に色々転がっていますが、
複合デバイスにする方法はあまりまとまっていなかったので、
ここにまとめます。</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
宣伝
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
いきなり本題から離れますが、
USB Gadget 機能を利用して Raspberry Pi Zero W を
<strong>OS に依存しない keyboard remapper にするツール</strong> を公開しています。</p>
<p>
keyboard のキー入れ替えを使用している方は使ってみてください。</p>
<p>
&lt;<a href="https://ifritjp.github.io/blog2/public/posts/2022/2022-01-10-hw-keyboard-remapper/">https://ifritjp.github.io/blog2/public/posts/2022/2022-01-10-hw-keyboard-remapper/</a>&gt;</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
USB Gadget 機能
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
USB Gadget は Linux カーネルでサポートされる由緒正しい機能で、
HID デバイスや MASS Storage など様々なデバイスの機能をサポートしています。</p>
<p>
USB Gadget は、予め用意された機能を提供するデバイスとして振る舞う方法と、
複数の機能を組み合わせて提供する
複合デバイスとして動作する方法 (libcomposite) の 2 種類あります。</p>
<p>
前者の「予め用意された機能」の代表的な機能には、以下があります。</p>
<ul>
<li>Serial (g_serial)</li>
<li>Ethernet (g_ether)</li>
<li>Mass storage (g_mass_storage)</li>
</ul>
<p>例えば Ethernet(RNDIS) として利用したい場合、
次のようにモジュールを読み込むだけで USB を使った NIC がカーネル上に認識されます。</p>
<pre class="example">
$ modprobe g_ether
</pre>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
単機能と複合デバイスの違い
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>
予め用意された機能を利用するには、
modprobe でモジュールを読み込むだけで実現できます。</p>
<p>
一方で、複合デバイスの場合、
どの機能を組合せるのかを指定する必要があり、複雑になります。</p>
<p>
<strong>「予め用意された機能」単体で利用するのと、「複数の機能を組み合わせる」のとでは、</strong>
<strong>設定方法が全く異なるということを認識しておく必要があります。</strong></p>
<p>
この違いさえ理解すれば、後は組み合わせ方法が分かれば実現できます。</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
libcomposite と configfs
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>
複合デバイスの制御は libcomposite を利用します。
そのため、まずは libcomposite を読み込みます。</p>
<pre class="example">
$ modprobe libcomposite
</pre>
<p>
次に、 どの機能を組合せるのかを指定するには
configfs というファイルシステムを利用し、
そこに予め規定されているファイルを作成することで、必要なパラメータを指定します。</p>
<p>
configfs は事前に /sys/kernel/config にマウントされているので、
ここを利用するか、
別途新しいディレクトリを configfs でマウントして作業します。</p>
<p>
USB Gadget のパラメータをセットする場合、
/sys/kernel/config の下の usb_gadget ディレクトリ内に任意の名前のディレクトリを作成し、
そのディレクトリ中に設定ファイルを作成することになります。</p>
<pre class="example">
sudo mkdir -p /sys/kernel/config/usb_gadget/g1
</pre>
<p>
以降の説明では、この usb_gadget ディレクトリ内に
作成した任意のディレクトリを <code class="verbatim">GADGET_ROOT</code> とします。</p>
<p>
<code class="verbatim">GADGET_ROOT</code> 以降に作成するファイルは、
組合せる機能に関係なく共通で指定するものと、
組合せる機能ごとに指定が必要なものがあります。</p>
<p>
<strong>以降のファイルパスは、原則 GADGET_ROOT からの相対です</strong></p>
<p>
手順の概要は以下の通りです。</p>
<ul>
<li>共通ファイルの作成</li>
<li>機能ごとのファイルの作成</li>
<li>機能の組み合わせを示すファイルの作成  </li>
<li>config 確定    </li>
</ul>
<div id="outline-container-headline-5" class="outline-4">
<h4 id="headline-5">
共通ファイルの作成 の作成
</h4>
<div id="outline-text-headline-5" class="outline-text-4">
<p>
共通ファイルは、 USB 規格で定義されている Device Descriptor の内容を設定する情報です。</p>
<table>
<thead>
<tr>
<th>ファイルパス</th>
<th>規定値</th>
<th>内容</th>
<th>Mandatory</th>
</tr>
</thead>
<tbody>
<tr>
<td>idVendor</td>
<td>&#34;0x1d6b&#34;</td>
<td>Linux Foundation</td>
<td>mandatory</td>
</tr>
<tr>
<td>idProduct</td>
<td>&#34;0x0104&#34;</td>
<td>Multifunction Composite Gadget</td>
<td>mandatory</td>
</tr>
<tr>
<td>bcdDevice</td>
<td></td>
<td></td>
<td>option</td>
</tr>
<tr>
<td>bcdUSB</td>
<td></td>
<td></td>
<td>option</td>
</tr>
<tr>
<td>bMaxPacketSize0</td>
<td></td>
<td></td>
<td>option</td>
</tr>
<tr>
<td>bDeviceProtocol</td>
<td></td>
<td></td>
<td>option</td>
</tr>
<tr>
<td>bDeviceSubClass</td>
<td></td>
<td></td>
<td>option</td>
</tr>
<tr>
<td>bDeviceClass</td>
<td></td>
<td></td>
<td>option</td>
</tr>
<tr>
<td>strings/0x409/serialnumber</td>
<td></td>
<td></td>
<td>mandatory</td>
</tr>
<tr>
<td>strings/0x409/manufacturer</td>
<td></td>
<td></td>
<td>mandatory</td>
</tr>
<tr>
<td>strings/0x409/product</td>
<td></td>
<td></td>
<td>mandatory</td>
</tr>
</tbody>
</table>
<p>
idVendor, idProduct については &lt;<a href="http://www.linux-usb.org/usb.ids">http://www.linux-usb.org/usb.ids</a>&gt; 参照。</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-4">
<h4 id="headline-6">
機能ごとのファイルの作成
</h4>
<div id="outline-text-headline-6" class="outline-text-4">
<p>
機能ごとのファイルは、以下のパス以下に作成します。</p>
<pre class="example">
functions/&lt;name&gt;.&lt;instance name&gt;
</pre>
<p>
ここで <code class="verbatim">&lt;name&gt;</code> は、機能を示す文字列です。</p>
<p>
例えば RNDIS の場合は rndis、 HID の場合は hid になります。</p>
<p>
このディレクトリ内に、それぞれの機能ごとのパラメータを指定するファイルを作成します。</p>
<p>
機能毎に作成すべきディレクトリ名や、パラメータを指定するファイル名などの情報は、
以下を参照してください。</p>
<p>
&lt;<a href="https://wiki.tizen.org/USB/Linux_USB_Layers/Configfs_Composite_Gadget">https://wiki.tizen.org/USB/Linux_USB_Layers/Configfs_Composite_Gadget</a>&gt;</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-4">
<h4 id="headline-7">
機能の組み合わせを示すファイルの作成
</h4>
<div id="outline-text-headline-7" class="outline-text-4">
<p>
複合デバイスで提供する機能の組み合わせを、以下のディレクトリ以下に定義します。</p>
<pre class="example">
configs/&lt;name&gt;.&lt;number&gt;
</pre>
<p>
ここで name は任意の文字列です。number は 1 から初まる数字です。</p>
<p>
例えば以下になります。</p>
<pre class="example">
configs/c.1
</pre>
<p>
このディレクトリの下に、複数の機能を組合せることが出来ます。</p>
<p>
どの機能を組み合わせるのかを示すには、
以下のように機能毎のディレクトリのシンボリックリンクを作成することで設定します。</p>
<pre class="example">
ln -s functions/&lt;name&gt;.&lt;instance name&gt; configs/&lt;name&gt;.&lt;number&gt;
</pre>
<p>
configs/&lt;name&gt;.&lt;number&gt; 内には、複数の機能を含められます。</p>
<p>
また、このディレクトリの下には以下を作成する必要があります。</p>
<pre class="example">
configs/&lt;name&gt;.&lt;number&gt;/strings/0x409
</pre>
</div>
</div>
<div id="outline-container-headline-8" class="outline-4">
<h4 id="headline-8">
config 確定
</h4>
<div id="outline-text-headline-8" class="outline-text-4">
<p>
全ての機能、組み合わせの情報のファイルを作成後、
それらを確定させために以下を実行します。</p>
<pre class="example">
ls /sys/class/udc/ &gt; UDC
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
HID Keyboard と RNDIS の複合デバイスにする設定
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>
以下を参照してください。</p>
<p>
&lt;<a href="https://github.com/ifritJP/hw-keyboard-remapper/blob/main/usb_gadget/rndis_hid.sh">https://github.com/ifritJP/hw-keyboard-remapper/blob/main/usb_gadget/rndis_hid.sh</a>&gt;</p>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
参考
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>
libcomposite の使用方法のオリジナルリファレンスは以下です。</p>
<p>
&lt;<a href="https://www.kernel.org/doc/html/latest/usb/gadget_configfs.html">https://www.kernel.org/doc/html/latest/usb/gadget_configfs.html</a>&gt;</p>
</div>
</div>
<div class="edit-meta">

<br></div><nav class="pagination"><a class="nav nav-prev-2" href="https://ifritjp.github.io/documents/singleboard/bluetooth-a2dp-receiver/" title="Raspberry Pi で Bluetooth レシーバー (オーディオ:A2DP) を作成するための設定方法解説"><i class="fas fa-arrow-left" aria-hidden="true"></i> Prev - Raspberry Pi で Bluetooth レシーバー (オーディオ:A2DP) を作成するための設定方法解説</a>
<a class="nav nav-next-2" href="https://ifritjp.github.io/documents/singleboard/recover-image/" title="誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処">Next - 誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処 <i class="fas fa-arrow-right" aria-hidden="true"></i></a>
</nav><footer><p class="powered">Powered by <a href="https://gohugo.io">Hugo</a>. Theme by <a href="https://themes.gohugo.io/hugo-theme-techdoc/">TechDoc</a>. Designed by <a href="https://github.com/thingsym/hugo-theme-techdoc">Thingsym</a>.</p>
</footer>
</main><div class="sidebar">

<nav class="slide-menu">
<ul>
<li class=""><a href="https://ifritjp.github.io/documents">Home</a></li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lctags/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lctags/introduce/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/rename/">C/C&#43;&#43; ソースコードをリファクタリング by lctags on emacs (リネーム編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/enum/">C/C&#43;&#43; の enum 補完 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/highlight/">C/C&#43;&#43; の特定シンボルをハイライト by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/varsize/">C/C&#43;&#43; の変数サイズ確認 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callgraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなコールグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/modulegraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなモジュール構成図っぽいグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callfunc/">lctags で C 言語の関数コールを簡単に</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/register/">lctags のプロジェクト簡易登録</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/c-language/">lctags を開発している時に改めて感じた C 言語規格のイケてないところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/subroutine/">lctags を使って C/C&#43;&#43; ソースコードをリファクタリング(サブルーチン化編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/windows/">Windows で lctags (C言語/C&#43;&#43; のタグジャンプ、コールグラフ、etc..)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lua/">C/C&#43;&#43; 言語プログラマのための Lua 入門リファレンス<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lua/detail/">C インタフェース詳細編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/interface/">C インタフェース編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/fengari/">fengari の使い方 (Lua を Web ブラウザで動かす方法)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/lua5.4/">Lua 5.4 の主な変更点</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/anti-pattern/">Lua でやりがちなミス</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/pointer/">ポインタ編</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/emacs/">Emacs<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/emacs/simple-httpd/">emacs 簡易 HTTPD 化パケージ simple-httpd.el</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/emacs/company-mode/">自作言語 (LuneScript) の emacs company-mode backend 設定</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/go/">Goes<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/go/package/">Go のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/go/guide/">Go 入門</a></li>
</ul>
  
</li>

<li class=""><a href="https://ifritjp.github.io/documents/gcp/">Google Cloud Platform を使ってみる</a>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/javascript/">Javascripts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/javascript/d3force/">D3.js V4 forceSimulation のノード動的更新(追加・削除)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/javascript/thread/">JavaScript のスレッド(非同期処理)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/libclang/">Lua で C/C&#43;&#43; の構文解析 (libclang の Lua binding)<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/libclang/operator/">libclang で演算子を特定する方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/libclang/ast/">libclang の AST(Abstract Syntax Tree)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/rust/">Rusts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/rust/lifetime/">C/C&#43;&#43;エンジニアのための Rust のデータ所有権とライフタイム入門</a></li>
</ul>
  
</li>

<li class="parent has-sub-menu"><a href="https://ifritjp.github.io/documents/singleboard/">Singleboards<span class="mark opened">-</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/raspios64-point/">64bit 版 Raspberry Pi OS でカーネルモジュールを使った際に遭遇したエラーと対応方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/build-kernel-module-64/">64bit 版 Raspberry Pi OS のカーネルモジュールのビルド環境設定</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/bluetooth-a2dp-receiver/">Raspberry Pi で Bluetooth レシーバー (オーディオ:A2DP) を作成するための設定方法解説</a></li>
<li class="active"><a href="https://ifritjp.github.io/documents/singleboard/usb-gadget/">USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/recover-image/">誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lunescript/">トランスコンパイラ LuneScript で Lua の開発をもっと楽に!!<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial1/">00. はじめに</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial2.setup/">01. 導入編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial3.hello/">02. Hello world</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/crosscompile/">03. Lua バージョン間のクロスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/value/">04. 値編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/set/">04.2. Set 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/enum/">05. enum 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/match/">06. match 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/variable/">07. 変数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/branch/">08. 一般分岐構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/loop/">09. 繰り返し構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/func/">10. 関数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/multipleretval/">10.2. 多値の戻り値</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/defaultarg/">10.3. 引数の省略 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/arg/">10.4. 可変長引数、戻り値 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/closure/">10.5. クロージャ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilable/">11. nilable 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class1/">12. クラス 基本 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class2accessor/">13. accessor 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classinherit/">14. クラス 継承 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classadvertise/">15. クラス advertise 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classoverride/">16. クラス override 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/interface/">17. インタフェース 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classmapping/">18. mapping 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/generics/">19. generics 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilcond/">20. nil 条件演算子 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/import/">21. import/provide 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/require/">22. require/module 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/glue/">22.1. glue コードの半自動生成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua/">22.2. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/make/">23. ビルド 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/macro/">24. マクロ 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/cast/">25. キャスト 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/subfile/">26. subfile 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lazyloading/">27. 遅延ロード 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/shebang_main/">28. shebang とコマンドライン引数</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/dir/">29. LuneScript を利用するプロジェクトの推奨ディレクトリ構成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go/">80. Go 言語へのトランスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_package/">80.2 Go 言語へのトランスコンパイル時のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua_runtime/">80.3 Go へトランスコンパイルした際の Lua ランタイム</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_wasm/">80.4 LuneScript の WebAssembly 対応</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async/">81. 安全な非同期処理</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async_old/">81.1 非同期処理(過去情報)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/luago/">82. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lnstags/">A. lnstags によるタグジャンプ (ソースコードタグシステム)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/reason/">A. Lua のトランスコンパイラ LuneScript を開発した理由</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/regret/">A. LuneScript の言語仕様でミスだったと思っているところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/onweb/">A. Web ブラウザ上で動作する LuneScript</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/recommend/">A. トランスコンパイラ開発のすゝめ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/completion/">A.イマドキな開発環境でもっと楽しよう</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/box/">Box 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/test/">X. 言語開発の品質コントロールにおけるセルフホスティングの重要性とテスト設計</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design/">Y.1 LuneScript の開発方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design-2/">Y.2 LuneScript の開発(型情報管理)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design-3/">Y.3 LuneScript の開発(スコープとシンボル)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_study/">Z. Go 言語へのトランスコンパイル (検討段階)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/all/">全文検索用結合ファイル</a></li>
</ul>
  
</li>
</ul>
</nav>



<div class="sidebar-footer"></div>
</div>
</div><a href="#" id="backtothetop-fixed" class="backtothetop"
 data-backtothetop-duration="600"
 data-backtothetop-easing="easeOutQuart"
 data-backtothetop-fixed-fadeIn="1000"
 data-backtothetop-fixed-fadeOut="1000"
 data-backtothetop-fixed-bottom="10"
 data-backtothetop-fixed-right="20">
<span class="fa-layers fa-fw">
<i class="fas fa-circle"></i>
<i class="fas fa-arrow-circle-up"></i>
</span></a>
</div>
</body>
</html>
